
## Plan Result (repository)

[CI link](https://github.com/tqer39/terraform-github/actions/runs/8405023644)


<pre><code>Plan: 4 to add, 5 to change, 0 to destroy.</code></pre>

* Create
  * module.time_capsule.github_actions_repository_permissions.this
  * module.time_capsule.github_branch_default.this
  * module.time_capsule.github_branch_protection.this[&#34;main&#34;]
  * module.time_capsule.github_repository.this
* Update
  * module.blog.github_branch_protection.this[&#34;main&#34;]
  * module.renovate_config.github_branch_protection.this[&#34;main&#34;]
  * module.terraform_aws.github_branch_protection.this[&#34;main&#34;]
  * module.terraform_github.github_branch_protection.this[&#34;main&#34;]
  * module.terraform_vercel.github_branch_protection.this[&#34;main&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.blog.github_branch_protection.this["main"] will be updated in-place
  ~ resource "github_branch_protection" "this" {
        id                              = "BPR_kwDOH2ZKrM4CN8iH"
        # (10 unchanged attributes hidden)

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = false -> null
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - require_code_owner_reviews      = false -> null
          - require_last_push_approval      = false -> null
          - required_approving_review_count = 1 -> null
          - restrict_dismissals             = false -> null
        }

      + required_status_checks {
          + strict = true
        }

        # (1 unchanged block hidden)
    }

  # module.renovate_config.github_branch_protection.this["main"] will be updated in-place
  ~ resource "github_branch_protection" "this" {
        id                              = "BPR_kwDOH2quSc4CLaqA"
        # (10 unchanged attributes hidden)

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = false -> null
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - require_code_owner_reviews      = false -> null
          - require_last_push_approval      = false -> null
          - required_approving_review_count = 1 -> null
          - restrict_dismissals             = false -> null
        }

      + required_status_checks {
          + strict = true
        }

        # (1 unchanged block hidden)
    }

  # module.terraform_aws.github_branch_protection.this["main"] will be updated in-place
  ~ resource "github_branch_protection" "this" {
        id                              = "BPR_kwDOHQj_Nc4CLayc"
        # (10 unchanged attributes hidden)

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = false -> null
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - require_code_owner_reviews      = false -> null
          - require_last_push_approval      = false -> null
          - required_approving_review_count = 1 -> null
          - restrict_dismissals             = false -> null
        }

      ~ required_status_checks {
          ~ contexts = [
              - "Delete PR Comments",
            ]
            # (1 unchanged attribute hidden)
        }
      + required_status_checks {
          + strict = true
        }
    }

  # module.terraform_github.github_branch_protection.this["main"] will be updated in-place
  ~ resource "github_branch_protection" "this" {
        id                              = "BPR_kwDOJRL88s4CMVng"
        # (10 unchanged attributes hidden)

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = false -> null
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - require_code_owner_reviews      = false -> null
          - require_last_push_approval      = false -> null
          - required_approving_review_count = 1 -> null
          - restrict_dismissals             = false -> null
        }

      ~ required_status_checks {
          ~ contexts = [
              + "pre-commit",
              + "terraform-github",
            ]
            # (1 unchanged attribute hidden)
        }
      + required_status_checks {
          + contexts = [
              + "pre-commit",
              + "terraform-github",
            ]
          + strict   = true
        }
    }

  # module.terraform_vercel.github_branch_protection.this["main"] will be updated in-place
  ~ resource "github_branch_protection" "this" {
        id                              = "BPR_kwDOJfzjl84CN8nF"
        # (10 unchanged attributes hidden)

      - required_pull_request_reviews {
          - dismiss_stale_reviews           = false -> null
          - dismissal_restrictions          = [] -> null
          - pull_request_bypassers          = [] -> null
          - require_code_owner_reviews      = false -> null
          - require_last_push_approval      = false -> null
          - required_approving_review_count = 1 -> null
          - restrict_dismissals             = false -> null
        }

      + required_status_checks {
          + strict = true
        }

        # (1 unchanged block hidden)
    }

  # module.time_capsule.github_actions_repository_permissions.this will be created
  + resource "github_actions_repository_permissions" "this" {
      + allowed_actions = "all"
      + enabled         = true
      + id              = (known after apply)
      + repository      = "time-capsule"
    }

  # module.time_capsule.github_branch_default.this will be created
  + resource "github_branch_default" "this" {
      + branch     = "main"
      + etag       = (known after apply)
      + id         = (known after apply)
      + rename     = false
      + repository = "time-capsule"
    }

  # module.time_capsule.github_branch_protection.this["main"] will be created
  + resource "github_branch_protection" "this" {
      + allows_deletions                = false
      + allows_force_pushes             = false
      + enforce_admins                  = false
      + id                              = (known after apply)
      + lock_branch                     = false
      + pattern                         = "main"
      + repository_id                   = "time-capsule"
      + require_conversation_resolution = false
      + require_signed_commits          = false
      + required_linear_history         = true

      + required_status_checks {
          + strict = true
        }
      + required_status_checks {
          + strict = true
        }
    }

  # module.time_capsule.github_repository.this will be created
  + resource "github_repository" "this" {
      + allow_auto_merge            = true
      + allow_merge_commit          = true
      + allow_rebase_merge          = true
      + allow_squash_merge          = true
      + allow_update_branch         = true
      + archived                    = false
      + auto_init                   = true
      + default_branch              = (known after apply)
      + delete_branch_on_merge      = true
      + description                 = "Create a time capsule repository."
      + etag                        = (known after apply)
      + full_name                   = (known after apply)
      + git_clone_url               = (known after apply)
      + has_issues                  = true
      + has_projects                = false
      + has_wiki                    = false
      + html_url                    = (known after apply)
      + http_clone_url              = (known after apply)
      + id                          = (known after apply)
      + merge_commit_message        = "PR_TITLE"
      + merge_commit_title          = "MERGE_MESSAGE"
      + name                        = "time-capsule"
      + node_id                     = (known after apply)
      + primary_language            = (known after apply)
      + private                     = (known after apply)
      + repo_id                     = (known after apply)
      + squash_merge_commit_message = "COMMIT_MESSAGES"
      + squash_merge_commit_title   = "COMMIT_OR_PR_TITLE"
      + ssh_clone_url               = (known after apply)
      + svn_url                     = (known after apply)
      + topics                      = [
          + "managed-by-terraform-github",
          + "time-capsule",
        ]
      + visibility                  = "public"
      + vulnerability_alerts        = false
      + web_commit_signoff_required = false
    }

Plan: 4 to add, 5 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"terraform","PRNumber":390,"Program":"tfcmt","SHA1":"f4d1bc910327ac3e79e3fddaaf2fe003a2360766","Target":"repository","Vars":{},"WorkflowName":"Terraform - GitHub"} -->